Revit 2024 API
BuiltInFailures.RebarCouplerFailures.LengthParameterWarning Property
 This is used to post warning. The "Total Length" parameter must be set to a strictly positive value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId LengthParameterWarning { get; }
Visual Basic
Public Shared ReadOnly Property LengthParameterWarning As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ LengthParameterWarning {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RebarCouplerFailures Class
Autodesk.Revit.DB Namespace